       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Will Walker.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. Linux.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  GREETING          PIC X(20) VALUE 'HELLO, WORLD!'.
       01  COUNTER           PIC 9(2) VALUE 10.

       PROCEDURE DIVISION.
       COUNT-DOWN.
           PERFORM VARYING COUNTER FROM 10 BY -1 UNTIL COUNTER = 0
               DISPLAY "Counter: " COUNTER
           END-PERFORM.

       BEGIN.
           DISPLAY GREETING.
           PERFORM COUNT-DOWN.
           STOP RUN.
